// 5. По заданной пользователем дате рождения сообщить его возраст в годах, месяцах и днях.
// *** needd to work

function Geburtstag(arg) {

строку в массив, распарсить точками

каждый элем проверить на число
если не число - выход
проверить - дд не больше 31 и число
проверить - мм не больше 12 и число
проверить - гггг = число
проверить - элементов в массиве = 3


return 0;
}

};

let inputGeburtstag = prompt("введите дату ралжения - дд.мм.гггг");
let a = Geburtstag(inputGeburtstag);
console.log(a);

